Revit 2027 API
CableTrayShape Enumeration
 Shape types enum of cable tray
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum CableTrayShape
Public Enumeration CableTrayShape
public enum class CableTrayShape
type CableTrayShape
Members
Member name | Value | Description
Channel | 1 |  Channel cable tray shape.
Invalid | 0 |  Invalid cable tray shape.
Ladder | 2 |  Ladder cable tray shape.
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace